
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсходныеНастройки = ПолучитьИзВременногоХранилища(Параметры.ДополнительныеПоляДублей);
	УдалитьИзВременногоХранилища(Параметры.ДополнительныеПоляДублей);
	
	ДополнительныеПоляДублей.Загрузить(ИсходныеНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	ОповеститьОВыборе(РезультатВыбора());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РезультатВыбора()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДополнительныеПоляДублей", ДополнительныеПоляДублей.Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(Результат);
	
КонецФункции

#КонецОбласти